In [1]:
import numpy as np
import pandas as pd

If you get an error, run the following command in a separate cell:

> conda install pandas

# Dataframes from scratch

In [2]:
dico = {"name": ["Ben", "Max", "John", "Ema", "Alice"],
        "age" : [25,20,18,10,33],
        "gender": ["m", "m", "m", "f", "f"]}
dico

{'age': [25, 20, 18, 10, 33],
 'gender': ['m', 'm', 'm', 'f', 'f'],
 'name': ['Ben', 'Max', 'John', 'Ema', 'Alice']}

In [12]:
truc = pd.DataFrame(dico)

In [4]:
x = pd.Series(["Ben", "Max", "John", "Ema", "Alice"], name="name")
x

0      Ben
1      Max
2     John
3      Ema
4    Alice
Name: name, dtype: object

In [9]:
y = pd.Series([25,20,18,10,33], name="age")
z = pd.Series(["m", "m", "m", "f", "m"], name="gender")

pd.concat([x, y ,z], axis=1)

    name  age gender
0    Ben   25      m
1    Max   20      m
2   John   18      m
3    Ema   10      f
4  Alice   33      m

## Exercises

In [10]:
np.random.choice(["a", "b"], size=5)

array(['b', 'b', 'a', 'b', 'a'],
      dtype='<U1')

In [11]:
np.random.randint(10,20, size=5)

array([18, 11, 17, 19, 13])

* Create your own data frame with 2 columns and 100 rows:
    * first column should be a random name: Ben, Tom of John (use np.random.choice)
    * second column should be a random age between 20 and 40 
* print the last 6 rows

### Solution

In [16]:
name = np.random.choice(["Ben", "Tom", "John"], replace=True, size=100)
age = np.random.randint(20, 40, size=100)

pd.concat([pd.Series(name, name="name"),
          pd.Series(age, name="age")],
         axis = 1).tail()

    name  age
95  John   34
96   Tom   26
97   Tom   33
98   Ben   32
99  John   20

# Manipulating data

## Import files

In [17]:
df = pd.read_csv("vgsales.csv")

In [18]:
df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,259,Asteroids,2600,1980,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
1,545,Missile Command,2600,1980,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
2,1768,Kaboom!,2600,1980,Misc,Activision,1.07,0.07,0.0,0.01,1.15
3,1971,Defender,2600,1980,Misc,Atari,0.99,0.05,0.0,0.01,1.05
4,2671,Boxing,2600,1980,Fighting,Activision,0.72,0.04,0.0,0.01,0.77

In [20]:
df.tail(2)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
16322,16579,Rugby Challenge 3,XOne,2016,Sports,Alternative Software,0.0,0.01,0.00,0.0,0.01
16323,16592,Chou Ezaru wa Akai Hana: Koi wa Tsuki ni Shiru...,PSV,2016,Action,dramatic create,0.0,0.00,0.01,0.0,0.01

In [21]:
df.shape

(16324, 11)

In [26]:
df.columns

Index(['Rank', 'Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16324 entries, 0 to 16323
Data columns (total 11 columns):
Rank            16324 non-null int64
Name            16324 non-null object
Platform        16324 non-null object
Year            16324 non-null int64
Genre           16324 non-null object
Publisher       16288 non-null object
NA_Sales        16324 non-null float64
EU_Sales        16324 non-null float64
JP_Sales        16324 non-null float64
Other_Sales     16324 non-null float64
Global_Sales    16324 non-null float64
dtypes: float64(5), int64(2), object(4)
memory usage: 1.4+ MB

In [28]:
df.dtypes

Rank              int64
Name             object
Platform         object
Year              int64
Genre            object
Publisher        object
NA_Sales        float64
EU_Sales        float64
JP_Sales        float64
Other_Sales     float64
Global_Sales    float64
dtype: object

In [30]:
df["Global_Sales"].head()

0    4.31
1    2.76
2    1.15
3    1.05
4    0.77
Name: Global_Sales, dtype: float64

In [31]:
print(type(df))
print(type(df["Global_Sales"]))
print(type(df["Global_Sales"].values))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

In [32]:
df[ ["Name", "Rank"] ].head()

              Name  Rank
0        Asteroids   259
1  Missile Command   545
2          Kaboom!  1768
3         Defender  1971
4           Boxing  2671

In [33]:
df.iloc[:5]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,259,Asteroids,2600,1980,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
1,545,Missile Command,2600,1980,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
2,1768,Kaboom!,2600,1980,Misc,Activision,1.07,0.07,0.0,0.01,1.15
3,1971,Defender,2600,1980,Misc,Atari,0.99,0.05,0.0,0.01,1.05
4,2671,Boxing,2600,1980,Fighting,Activision,0.72,0.04,0.0,0.01,0.77

In [34]:
df.iloc[:5,:3]

   Rank             Name Platform
0   259        Asteroids     2600
1   545  Missile Command     2600
2  1768          Kaboom!     2600
3  1971         Defender     2600
4  2671           Boxing     2600

In [35]:
df.loc[:4,:"EU_Sales"]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales
0,259,Asteroids,2600,1980,Shooter,Atari,4.00,0.26
1,545,Missile Command,2600,1980,Shooter,Atari,2.56,0.17
2,1768,Kaboom!,2600,1980,Misc,Activision,1.07,0.07
3,1971,Defender,2600,1980,Misc,Atari,0.99,0.05
4,2671,Boxing,2600,1980,Fighting,Activision,0.72,0.04

## statistics

In [36]:
df["Global_Sales"].mean()

0.54032773829943637

In [37]:
df["Global_Sales"].min()

0.01

In [38]:
df["Global_Sales"].var()

2.4519165071739324

In [39]:
df.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16324.000000,16324.000000,16324.000000,16324.000000,16324.000000,16324.000000,16324.000000
mean,8291.508270,2006.404251,0.265464,0.147581,0.078673,0.048334,0.540328
std,4792.043734,5.826744,0.821658,0.508809,0.311584,0.189902,1.565860
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4135.750000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8293.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12439.250000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.480000
max,16600.000000,2016.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [40]:
df["Platform"].value_counts()

DS      2133
PS2     2127
PS3     1304
Wii     1290
X360    1235
PSP     1197
PS      1189
PC       943
GBA      811
XB       803
GC       542
3DS      500
PSV      410
PS4      335
N64      316
SNES     239
XOne     213
SAT      173
WiiU     143
2600     116
NES       98
GB        97
DC        52
GEN       27
NG        12
SCD        6
WS         6
3DO        3
TG16       2
PCFX       1
GG         1
Name: Platform, dtype: int64

## SQL like operations: filter, groupby, sort, joins

In [41]:
df["Platform"] == "PS4"

0        False
1        False
2        False
3        False
4        False
5        False
6        False
7        False
8        False
9        False
10       False
11       False
12       False
13       False
14       False
15       False
16       False
17       False
18       False
19       False
20       False
21       False
22       False
23       False
24       False
25       False
26       False
27       False
28       False
29       False
         ...
16294     True
16295    False
16296    False
16297    False
16298    False
16299    False
16300    False
16301     True
16302    False
16303    False
16304    False
16305    False
16306    False
16307    False
16308    False
16309    False
16310    False
16311    False
16312    False
16313    False
16314    False
16315    False
16316    False
16317     True
16318    False
16319    False
16320    False
16321     True
16322    False
16323    False
Name: Platform, Length: 16324, dtype: bool

In [42]:
df[df["Platform"] == "PS4"].head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
14254,350,Call of Duty: Ghosts,PS4,2013,Shooter,Activision,1.78,1.42,0.05,0.38,3.63
14257,387,Battlefield 4,PS4,2013,Shooter,Electronic Arts,1.34,1.54,0.17,0.38,3.43
14260,494,FIFA 14,PS4,2013,Sports,Electronic Arts,0.61,1.85,0.11,0.33,2.90
14262,547,Assassin's Creed IV: Black Flag,PS4,2013,Action,Ubisoft,1.07,1.31,0.06,0.31,2.74
14263,594,Killzone: Shadow Fall,PS4,2013,Shooter,Sony Computer Entertainment,0.89,1.33,0.07,0.28,2.58
14282,911,Need for Speed Rivals,PS4,2013,Racing,Electronic Arts,0.73,0.91,0.03,0.22,1.89
14294,1089,Knack,PS4,2013,Platform,Sony Computer Entertainment Europe,0.43,0.67,0.42,0.15,1.67
14297,1195,LEGO Marvel Super Heroes,PS4,2013,Action,Warner Bros. Interactive Entertainment,0.59,0.75,0.01,0.21,1.56
14311,1472,NBA 2K14,PS4,2013,Sports,Take-Two Interactive,0.89,0.31,0.01,0.12,1.33
14343,2395,Injustice: Gods Among Us,PS4,2013,Fighting,Warner Bros. Interactive Entertainment,0.46,0.29,0.00,0.12,0.87

In [43]:
df.sort_values(["Year", "Platform"], ascending=False).head(5)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
15984,847,Tom Clancy's The Division,XOne,2016,Shooter,Ubisoft,1.20,0.62,0.0,0.18,2.01
15988,1226,FIFA 17,XOne,2016,Sports,Electronic Arts,0.17,1.26,0.0,0.10,1.53
15998,2436,Far Cry: Primal,XOne,2016,Action,Ubisoft,0.46,0.32,0.0,0.07,0.85
15999,2446,Overwatch,XOne,2016,Shooter,Activision,0.52,0.25,0.0,0.08,0.85
16002,2507,Madden NFL 17,XOne,2016,Sports,Electronic Arts,0.72,0.02,0.0,0.09,0.82

In [45]:
df[["Platform", "Global_Sales"]].groupby("Platform").mean().reset_index()

   Platform  Global_Sales
0      2600      0.746293
1       3DO      0.033333
2       3DS      0.492560
3        DC      0.307115
4        DS      0.383947
5        GB      2.622887
6       GBA      0.386634
7        GC      0.363727
8       GEN      1.050370
9        GG      0.040000
10      N64      0.690538
11      NES      2.561939
12       NG      0.120000
13       PC      0.270467
14     PCFX      0.030000
15       PS      0.611766
16      PS2      0.579906
17      PS3      0.728029
18      PS4      0.830060
19      PSP      0.243701
20      PSV      0.150268
21      SAT      0.194162
22      SCD      0.311667
23     SNES      0.837029
24     TG16      0.080000
25       WS      0.236667
26      Wii      0.705279
27     WiiU      0.572448
28     X360      0.785109
29       XB      0.313935
30     XOne      0.662254

In [46]:
df1 = pd.DataFrame({'id': [1,2,4,5], 'var1': [22,21,18,30]})
df2 = pd.DataFrame({'id': [1,2,3,5], 'var2': [1,1,3,2]})

display(df1, df2)

   id  var1
0   1    22
1   2    21
2   4    18
3   5    30

   id  var2
0   1     1
1   2     1
2   3     3
3   5     2

In [47]:
pd.merge(df1, df2, how="left", on="id")

   id  var1  var2
0   1    22   1.0
1   2    21   1.0
2   4    18   NaN
3   5    30   2.0

In [48]:
pd.merge(df1, df2, how="inner", on="id")

   id  var1  var2
0   1    22     1
1   2    21     1
2   5    30     2

In [49]:
pd.merge(df1, df2, how="outer", on="id")

   id  var1  var2
0   1  22.0   1.0
1   2  21.0   1.0
2   4  18.0   NaN
3   5  30.0   2.0
4   3   NaN   3.0

## Exercise

* select the 10 ranked video games and keep only the following columns: Name, Year, Genre, Publisher, EU_Sales
* what do they have in common ?

* select top 5 video games from PS4 or XOne with highest global sales in descending order

### Solution

In [58]:
df.sort_values("Rank")[["Name", "Year", "Genre", "Publisher", "EU_Sales"]].head(10)

                           Name  Year         Genre Publisher  EU_Sales
6112                 Wii Sports  2006        Sports  Nintendo     29.02
122           Super Mario Bros.  1985      Platform  Nintendo      3.58
8322             Mario Kart Wii  2008        Racing  Nintendo     12.88
9750          Wii Sports Resort  2009        Sports  Nintendo     11.01
705    Pokemon Red/Pokemon Blue  1996  Role-Playing  Nintendo      8.89
188                      Tetris  1989        Puzzle  Nintendo      2.26
6113      New Super Mario Bros.  2006      Platform  Nintendo      9.23
6114                   Wii Play  2006          Misc  Nintendo      9.20
9751  New Super Mario Bros. Wii  2009      Platform  Nintendo      7.06
108                   Duck Hunt  1984       Shooter  Nintendo      0.63

In [59]:
df[(df["Platform"] == "PS4") | (df["Platform"] == "XOne")].sort_values("Global_Sales", ascending=False).head(5)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
15366,34,Call of Duty: Black Ops 3,PS4,2015,Shooter,Activision,5.77,5.81,0.35,2.31,14.24
14784,45,Grand Theft Auto V,PS4,2014,Action,Take-Two Interactive,3.80,5.81,0.36,2.02,11.98
15367,78,FIFA 16,PS4,2015,Sports,Electronic Arts,1.11,6.06,0.06,1.26,8.49
15368,93,Star Wars Battlefront (2015),PS4,2015,Shooter,Electronic Arts,2.93,3.29,0.22,1.23,7.67
14786,94,Call of Duty: Advanced Warfare,PS4,2014,Shooter,Activision,2.80,3.30,0.14,1.37,7.60

## data cleaning

disclaimer: data cleaning and preparation is a broad topic and cannot be covered in a few hours only.

I show here the most basic steps, but you would have to look at the documentation when you will work on complex data

In [ ]:
df.isna().sum()

In [ ]:
df = df.fillna("missing") #missing values
df.isna().sum()

In [ ]:
df = df.drop_duplicates() #in case there are duplicates

In [ ]:
df["Name"].str.upper().head()

In [14]:
df["Name"].str.split(" ", n=1, expand=True).fillna("").head(10)

           0        1
0  Asteroids
1    Missile  Command
2    Kaboom!
3   Defender
4     Boxing
5        Ice   Hockey
6    Freeway
7     Bridge
8   Checkers
9   Pitfall!

In [17]:
df["platform_genre"] = df["Platform"] + "-" + df["Genre"]
df["platform_genre"].head()

0     2600-Shooter
1     2600-Shooter
2        2600-Misc
3        2600-Misc
4    2600-Fighting
Name: platform_genre, dtype: object

In [ ]:
df["blockbuster"] = df["Global_Sales"] > 10
df.head()

In [ ]:
df[df["blockbuster"]].sort_values("Name")

## data reshaping

In [ ]:
# pivot table as in Excel for analysis
df.pivot_table(index="Platform", columns="Genre", values = "Global_Sales", aggfunc="sum")

In [ ]:
df.reset_index()

In [ ]:
# wide to long, needed for visualization purposes
df.melt(id_vars=['Platform', 'Genre'], value_vars=["EU_Sales", "Global_Sales"])

# Exercises

* Import the netflix dataset
* display info about the dataset (nrows, columns, etc)

* Check if there are missing values in columns
* identify columns with more that 9% missing values and drop them
* also remove the show_id columns

* Answer the following questions:
    * are there more movies or TV shows?
    * what are the 3 countries producing the more movies?
    * what is the longest and shortest film?
* (Optional) List TV-shows that have more than 10 seasons?

### Solution

In [33]:
netflix = pd.read_csv('netflix_titles.csv', parse_dates=["date_added"])
netflix.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 12 columns):
show_id         6234 non-null int64
type            6234 non-null object
title           6234 non-null object
director        4265 non-null object
cast            5664 non-null object
country         5758 non-null object
date_added      6223 non-null datetime64[ns]
release_year    6234 non-null int64
rating          6224 non-null object
duration        6234 non-null object
listed_in       6234 non-null object
description     6234 non-null object
dtypes: datetime64[ns](1), int64(2), object(9)
memory usage: 584.5+ KB

In [32]:
netflix.isna().sum()

show_id            0
type               0
title              0
director        1969
cast             570
country          476
date_added        11
release_year       0
rating            10
duration           0
listed_in          0
description        0
dtype: int64

In [37]:
to_drop = netflix.columns[netflix.isna().mean() > 0.09].values.tolist()
to_drop

['director', 'cast']

In [38]:
netflix = netflix.drop(to_drop + ["show_id"], axis=1)
netflix.head(3)

,type,title,country,date_added,release_year,rating,duration,listed_in,description
0,Movie,Norm of the North: King Sized Adventure,"United States, India, South Korea, China",2019-09-09,2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,Movie,Jandino: Whatever it Takes,United Kingdom,2016-09-09,2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,TV Show,Transformers Prime,United States,2018-09-08,2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."

In [40]:
netflix["type"].value_counts()

Movie      4265
TV Show    1969
Name: type, dtype: int64

In [44]:
netflix["country"].value_counts()[:3]

United States     2032
India              777
United Kingdom     348
Name: country, dtype: int64

In [51]:
films = netflix[netflix["type"] == "Movie"].copy()
series = netflix[netflix["type"] == "TV Show"].copy()

films["duration"].str[:2].astype(int).describe()

count    4265.000000
mean       48.535287
std        36.618498
min         3.000000
25%        11.000000
50%        48.000000
75%        88.000000
max        99.000000
Name: duration, dtype: float64

In [62]:
series["n_seasons"] = series["duration"].str[:2].astype(int)
series[series["n_seasons"] > 10]

,type,title,country,date_added,release_year,rating,duration,listed_in,description,n_seasons
5787,TV Show,Supernatural,United States,2019-05-03,2019,TV-14,14 Seasons,"Classic & Cult TV, TV Action & Adventure, TV H...","Siblings Dean and Sam crisscross the country, ...",14
5843,TV Show,Trailer Park Boys,Canada,2018-03-30,2018,TV-MA,12 Seasons,"Classic & Cult TV, Crime TV Shows, Internation...",Follow the booze-fueled misadventures of three...,12
5879,TV Show,Criminal Minds,"United States, Canada",2017-06-30,2017,TV-14,12 Seasons,"Crime TV Shows, TV Dramas, TV Mysteries",This intense police procedural follows a group...,12
5908,TV Show,Grey's Anatomy,United States,2019-06-15,2018,TV-14,15 Seasons,"Romantic TV Shows, TV Dramas",Intern (and eventual resident) Meredith Grey f...,15
5974,TV Show,NCIS,United States,2018-07-01,2017,TV-14,15 Seasons,"Crime TV Shows, TV Dramas, TV Mysteries",Follow the quirky agents of the NCIS – the Nav...,15
5976,TV Show,Cheers,United States,2017-07-01,1992,TV-PG,11 Seasons,"Classic & Cult TV, TV Comedies","Sam Malone, an ex-baseball player turned bar o...",11
6021,TV Show,COMEDIANS of the world,United States,2019-01-01,2019,TV-MA,13 Seasons,"Stand-Up Comedy & Talk Shows, TV Comedies",This global stand-up comedy series features a ...,13
6174,TV Show,Heartland,Canada,2019-08-01,2017,TV-PG,11 Seasons,TV Dramas,Spunky teenager Amy is reeling from the sudden...,11
6225,TV Show,Frasier,United States,NaT,2003,TV-PG,11 Seasons,"Classic & Cult TV, TV Comedies",Frasier Crane is a snooty but lovable Seattle ...,11
6229,TV Show,Red vs. Blue,United States,NaT,2015,NR,13 Seasons,"TV Action & Adventure, TV Comedies, TV Sci-Fi ...","This parody of first-person shooter games, mil...",13